---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.UndoOperation.TransactionGroupRolledBack
enum: Autodesk.Revit.DB.Events.UndoOperation
source: html/d5c8c31a-3b69-48c0-feac-b176a54e7934.htm
---
# Autodesk.Revit.DB.Events.UndoOperation.TransactionGroupRolledBack

A transaction group was rolled back